Билет4/src/Documents/КупляПродажа/КупляПродажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КупляПродажа</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>ОрганизацияПоставщик</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоставщика</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПокупатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПокупателя</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет4/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Количесво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммарный</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

Билет4/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.01</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.02</code>
      </childItems>
      <childItems>
        <name>ТоварыВПути</name>
        <description>Товары в пути</description>
        <code>01.03</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>01.04</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ОсновноеПроизводство</name>
        <description>Основное производство</description>
        <code>01.05</code>
      </childItems>
      <childItems>
        <name>ОбщехозяйственныеЗатраты</name>
        <description>Общехозяйственные затраты</description>
        <code>01.06</code>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыВыданные</name>
        <description>Кредиты и займы выданные</description>
        <code>01.07</code>
      </childItems>
      <childItems>
        <name>Материалы</name>
        <description>Материалы</description>
        <code>01.08</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>02.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыПолученные</name>
        <description>Кредиты и займы полученные</description>
        <code>02.03</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Налоги</name>
        <description>Налоги</description>
        <code>02.04</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Агенты</name>
        <description>Агенты</description>
        <code>02.05</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ПрибылиУбытки</name>
      <description>Прибыли убытки</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммарный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Билет4/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Склады</types>
    <types>DocumentRef.ПриходнаяНакладная</types>
  </type>
  <predefined>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Организация</name>
      <description>Организация</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>Склад</name>
      <description>Склад</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Партия</name>
      <description>Партия</description>
      <code>000000004</code>
      <type>
        <types>DocumentRef.ПриходнаяНакладная</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Билет4/src/Documents/КупляПродажа/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КупляПродажаСписокНоменклатуры.Номенклатура,
	|	СУММА(КупляПродажаСписокНоменклатуры.Количество) КАК Количество,
	|	СУММА(КупляПродажаСписокНоменклатуры.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВремТ
	|ИЗ
	|	Документ.КупляПродажа.СписокНоменклатуры КАК КупляПродажаСписокНоменклатуры
	|ГДЕ
	|	КупляПродажаСписокНоменклатуры.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	КупляПродажаСписокНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТ.Номенклатура КАК Номенклатура,
	|	ВремТ.Количество КАК Количество,
	|	ВремТ.Сумма,
	|	УправленческийОстатки.Субконто4,
	|	ЕстьNull(УправленческийОстатки.КоличесвоОстаток,0) КАК КоличесвоОстаток,
	|	ЕстьNull(УправленческийОстатки.СуммаОстаток,0) как СуммаОстаток
	|ИЗ
	|	ВремТ КАК ВремТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(&Дата, Счет = &Товары, &Субконто, Субконто1 В
	|			(ВЫБРАТЬ
	|				ВремТ.Номенклатура
	|			ИЗ
	|				ВремТ КАК ВремТ)
	|		И Субконто2 = &ОрганизацияПоставщика
	|		И Субконто3 = &СкладПоставщика) КАК УправленческийОстатки
	|		ПО ВремТ.Номенклатура = УправленческийОстатки.Субконто1
	|ИТОГИ
	|	МАКСИМУМ(Количество) КАК Количество,
	|	СУММА(КоличесвоОстаток)
	|ПО
	|	Номенклатура";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Субконто = Новый массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Организация);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склад);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Партия);
	Запрос.УстановитьПараметр("Субконто", Субконто);
	Запрос.УстановитьПараметр("СкладПоставщика", СкладПоставщика);
	Запрос.УстановитьПараметр("ОрганизацияПоставщика", ОрганизацияПоставщик);
	Запрос.УстановитьПараметр("Товары", ПланыСчетов.Управленческий.Товары);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличесвоОстаток Тогда
			Отказ = Истина;
			Сообщить("Товара " + ВыборкаНоменклатура.Номенклатура + " нет. ЕСть только = "
				+ ВыборкаНоменклатура.КоличесвоОстаток);
			Продолжить;
		КонецЕсли;
		Если Не Отказ Тогда
			Выборка = ВыборкаНоменклатура.Выбрать();
			Осталось = ВыборкаНоменклатура.Количество;
			Пока Выборка.Следующий() Цикл
				Движение = Движения.Управленческий.Добавить();
				Движение.Период = Дата;
				Движение.СчетДт = ПланыСчетов.Управленческий.ПрибылиУбытки;
				Движение.СчетКт = ПланыСчетов.Управленческий.Товары;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Организация] = ОрганизацияПоставщик;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Партия] =Выборка.Субконто4;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = СкладПоставщика;
				Движение.Количесво = Мин(Осталось, Выборка.КоличесвоОстаток);
				Движение.СуммаДт = Движение.Количесво / Выборка.КоличесвоОстаток * Выборка.СуммаОстаток;
				Движение.СуммаКт = Движение.Количесво / Выборка.КоличесвоОстаток * Выборка.СуммаОстаток;
				
				Движение = Движения.Управленческий.Добавить();
				Движение.Период = Дата;
				Движение.СчетДт = ПланыСчетов.Управленческий.Товары;
				Движение.СчетКт = ПланыСчетов.Управленческий.Поставщики;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Организация] = ОрганизацияПокупатель;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Партия] =Выборка.Субконто4;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = СкладПокупателя;
				Движение.Количесво = Мин(Осталось, Выборка.КоличесвоОстаток);
				Движение.СуммаДт = Движение.Количесво / Выборка.Количество * Выборка.Сумма;
				Движение.СуммаКт = Движение.Количесво / Выборка.Количество * Выборка.Сумма;
				Осталось =Осталось -  Мин(Осталось, Выборка.КоличесвоОстаток);;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Движения.Управленческий.Записывать = Истина;
	Движение = Движения.Управленческий.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.Управленческий.Покупатели;
	Движение.СчетКт = ПланыСчетов.Управленческий.ПрибылиУбытки;
	Движение.СуммаДт = СписокНоменклатуры.Итог("Сумма");
	Движение.СуммаКт = СписокНоменклатуры.Итог("Сумма");

КонецПроцедуры
